In [209]:
import pandas as pd
from sklearn import metrics
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsRegressor
from sklearn.neural_network import MLPRegressor
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler

In [114]:
df = pd.read_csv('https://tinyurl.com/alugueis-sp-df')

In [115]:
df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,District,Negotiation Type,Property Type,Latitude,Longitude
0,930,220,47,2,2,1,1,0,0,0,0,Artur Alvim/São Paulo,rent,apartment,-23.543138,-46.479486
1,1000,148,45,2,2,1,1,0,0,0,0,Artur Alvim/São Paulo,rent,apartment,-23.550239,-46.480718
2,1000,100,48,2,2,1,1,0,0,0,0,Artur Alvim/São Paulo,rent,apartment,-23.542818,-46.485665
3,1000,200,48,2,2,1,1,0,0,0,0,Artur Alvim/São Paulo,rent,apartment,-23.547171,-46.483014
4,1300,410,55,2,2,1,1,1,0,0,0,Artur Alvim/São Paulo,rent,apartment,-23.525025,-46.482436
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0,Jabaquara/São Paulo,sale,apartment,-23.653004,-46.635463
13636,545000,630,74,3,2,1,2,0,0,1,0,Jabaquara/São Paulo,sale,apartment,-23.648930,-46.641982
13637,515000,1100,114,3,3,1,1,0,0,1,0,Jabaquara/São Paulo,sale,apartment,-23.649693,-46.649783
13638,345000,48,39,1,2,1,1,0,1,1,0,Jabaquara/São Paulo,sale,apartment,-23.652060,-46.637046
13639,161987,0,44,2,1,0,1,0,0,0,0,Jardim Ângela/São Paulo,sale,apartment,-23.613391,-46.523109

In [116]:
df["Negotiation Type"].unique()

array(['rent', 'sale'], dtype=object)

In [117]:
sales_df = df[df["Negotiation Type"] == "sale"]

In [118]:
sales_df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,District,Negotiation Type,Property Type,Latitude,Longitude
4901,732600,1000,74,1,2,1,2,1,0,1,0,Vila Madalena/São Paulo,sale,apartment,-23.552129,-46.692244
4902,1990000,2400,164,4,5,2,3,1,1,1,0,Vila Madalena/São Paulo,sale,apartment,-23.551613,-46.699106
4903,720000,700,70,2,2,1,1,1,0,1,1,Vila Madalena/São Paulo,sale,apartment,-23.547687,-46.692594
4904,1680000,1580,155,3,5,3,2,1,0,1,0,Vila Madalena/São Paulo,sale,apartment,-23.552590,-46.691104
4905,1200000,900,56,2,2,1,2,0,1,1,0,Vila Madalena/São Paulo,sale,apartment,-23.553087,-46.697890
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0,Jabaquara/São Paulo,sale,apartment,-23.653004,-46.635463
13636,545000,630,74,3,2,1,2,0,0,1,0,Jabaquara/São Paulo,sale,apartment,-23.648930,-46.641982
13637,515000,1100,114,3,3,1,1,0,0,1,0,Jabaquara/São Paulo,sale,apartment,-23.649693,-46.649783
13638,345000,48,39,1,2,1,1,0,1,1,0,Jabaquara/São Paulo,sale,apartment,-23.652060,-46.637046
13639,161987,0,44,2,1,0,1,0,0,0,0,Jardim Ângela/São Paulo,sale,apartment,-23.613391,-46.523109

In [119]:
region_df = df['District'].str.split('/', expand=True)
region_df

                   0          1
0        Artur Alvim  São Paulo
1        Artur Alvim  São Paulo
2        Artur Alvim  São Paulo
3        Artur Alvim  São Paulo
4        Artur Alvim  São Paulo
...              ...        ...
13635      Jabaquara  São Paulo
13636      Jabaquara  São Paulo
13637      Jabaquara  São Paulo
13638      Jabaquara  São Paulo
13639  Jardim Ângela  São Paulo

[13640 rows x 2 columns]

In [120]:
sales_df["Negotiation Type"].unique()

array(['sale'], dtype=object)

In [121]:
sales_df["Property Type"].unique()

array(['apartment'], dtype=object)

In [122]:
sales_df.drop(columns=["Negotiation Type", "Property Type"], inplace=True)

/var/folders/tf/pbrpvms96898w6bwjlhbg8lw0000gp/T/ipykernel_22204/2951421488.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_df.drop(columns=["Negotiation Type", "Property Type"], inplace=True)

In [123]:
sales_df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,District,Latitude,Longitude
4901,732600,1000,74,1,2,1,2,1,0,1,0,Vila Madalena/São Paulo,-23.552129,-46.692244
4902,1990000,2400,164,4,5,2,3,1,1,1,0,Vila Madalena/São Paulo,-23.551613,-46.699106
4903,720000,700,70,2,2,1,1,1,0,1,1,Vila Madalena/São Paulo,-23.547687,-46.692594
4904,1680000,1580,155,3,5,3,2,1,0,1,0,Vila Madalena/São Paulo,-23.552590,-46.691104
4905,1200000,900,56,2,2,1,2,0,1,1,0,Vila Madalena/São Paulo,-23.553087,-46.697890
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0,Jabaquara/São Paulo,-23.653004,-46.635463
13636,545000,630,74,3,2,1,2,0,0,1,0,Jabaquara/São Paulo,-23.648930,-46.641982
13637,515000,1100,114,3,3,1,1,0,0,1,0,Jabaquara/São Paulo,-23.649693,-46.649783
13638,345000,48,39,1,2,1,1,0,1,1,0,Jabaquara/São Paulo,-23.652060,-46.637046
13639,161987,0,44,2,1,0,1,0,0,0,0,Jardim Ângela/São Paulo,-23.613391,-46.523109

In [124]:
sales_df.drop(columns=["District", "Latitude", "Longitude"], inplace=True)
sales_df

/var/folders/tf/pbrpvms96898w6bwjlhbg8lw0000gp/T/ipykernel_22204/2913302406.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_df.drop(columns=["District", "Latitude", "Longitude"], inplace=True)

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New
4901,732600,1000,74,1,2,1,2,1,0,1,0
4902,1990000,2400,164,4,5,2,3,1,1,1,0
4903,720000,700,70,2,2,1,1,1,0,1,1
4904,1680000,1580,155,3,5,3,2,1,0,1,0
4905,1200000,900,56,2,2,1,2,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0
13636,545000,630,74,3,2,1,2,0,0,1,0
13637,515000,1100,114,3,3,1,1,0,0,1,0
13638,345000,48,39,1,2,1,1,0,1,1,0
13639,161987,0,44,2,1,0,1,0,0,0,0

In [126]:
final_df = pd.concat([sales_df, region_df], axis=1, join="inner")
final_df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,0,1
4901,732600,1000,74,1,2,1,2,1,0,1,0,Vila Madalena,São Paulo
4902,1990000,2400,164,4,5,2,3,1,1,1,0,Vila Madalena,São Paulo
4903,720000,700,70,2,2,1,1,1,0,1,1,Vila Madalena,São Paulo
4904,1680000,1580,155,3,5,3,2,1,0,1,0,Vila Madalena,São Paulo
4905,1200000,900,56,2,2,1,2,0,1,1,0,Vila Madalena,São Paulo
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0,Jabaquara,São Paulo
13636,545000,630,74,3,2,1,2,0,0,1,0,Jabaquara,São Paulo
13637,515000,1100,114,3,3,1,1,0,0,1,0,Jabaquara,São Paulo
13638,345000,48,39,1,2,1,1,0,1,1,0,Jabaquara,São Paulo
13639,161987,0,44,2,1,0,1,0,0,0,0,Jardim Ângela,São Paulo

In [127]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6412 entries, 4901 to 13639
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Price          6412 non-null   int64
 1   Condo          6412 non-null   int64
 2   Size           6412 non-null   int64
 3   Rooms          6412 non-null   int64
 4   Toilets        6412 non-null   int64
 5   Suites         6412 non-null   int64
 6   Parking        6412 non-null   int64
 7   Elevator       6412 non-null   int64
 8   Furnished      6412 non-null   int64
 9   Swimming Pool  6412 non-null   int64
 10  New            6412 non-null   int64
 11  0              6412 non-null   object
 12  1              6412 non-null   object
dtypes: int64(11), object(2)
memory usage: 701.3+ KB

In [128]:
final_df.rename(columns={0: 'District', 1: 'City'}, inplace=True)
final_df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,District,City
4901,732600,1000,74,1,2,1,2,1,0,1,0,Vila Madalena,São Paulo
4902,1990000,2400,164,4,5,2,3,1,1,1,0,Vila Madalena,São Paulo
4903,720000,700,70,2,2,1,1,1,0,1,1,Vila Madalena,São Paulo
4904,1680000,1580,155,3,5,3,2,1,0,1,0,Vila Madalena,São Paulo
4905,1200000,900,56,2,2,1,2,0,1,1,0,Vila Madalena,São Paulo
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0,Jabaquara,São Paulo
13636,545000,630,74,3,2,1,2,0,0,1,0,Jabaquara,São Paulo
13637,515000,1100,114,3,3,1,1,0,0,1,0,Jabaquara,São Paulo
13638,345000,48,39,1,2,1,1,0,1,1,0,Jabaquara,São Paulo
13639,161987,0,44,2,1,0,1,0,0,0,0,Jardim Ângela,São Paulo

In [129]:
final_df["City"].unique()

array(['São Paulo'], dtype=object)

In [130]:
final_df.drop(columns=["City"], inplace=True)
final_df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,District
4901,732600,1000,74,1,2,1,2,1,0,1,0,Vila Madalena
4902,1990000,2400,164,4,5,2,3,1,1,1,0,Vila Madalena
4903,720000,700,70,2,2,1,1,1,0,1,1,Vila Madalena
4904,1680000,1580,155,3,5,3,2,1,0,1,0,Vila Madalena
4905,1200000,900,56,2,2,1,2,0,1,1,0,Vila Madalena
...,...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0,Jabaquara
13636,545000,630,74,3,2,1,2,0,0,1,0,Jabaquara
13637,515000,1100,114,3,3,1,1,0,0,1,0,Jabaquara
13638,345000,48,39,1,2,1,1,0,1,1,0,Jabaquara
13639,161987,0,44,2,1,0,1,0,0,0,0,Jardim Ângela

In [131]:
final_df["District"].unique()

array(['Vila Madalena', 'Mooca', 'Brooklin', 'Vila Olimpia',
       'Barra Funda', 'Bela Vista', 'Bom Retiro', 'Brás', 'Consolação',
       'Liberdade', 'Pari', 'República', 'Santa Cecília', 'Sé',
       'Casa Verde', 'Jaçanã', 'Mandaqui', 'Santana', 'Tremembé',
       'Tucuruvi', 'Vila Guilherme', 'Vila Maria', 'Medeiros',
       'Água Rasa', 'Aricanduva', 'Artur Alvim', 'Belém', 'Cangaíba',
       'Carrão', 'Cidade Líder', 'Cidade Tiradentes',
       'Ermelino Matarazzo', 'Guaianazes', 'Iguatemi', 'Itaim Paulista',
       'Itaquera', 'Jardim Helena', 'José Bonifácio', 'Lajeado',
       'Parque do Carmo', 'Penha', 'Ponte Rasa', 'Sapopemba', 'São Lucas',
       'São Mateus', 'São Miguel', 'São Rafael', 'Tatuapé', 'Vila Curuçá',
       'Vila Formosa', 'Vila Jacuí', 'Vila Matilde', 'Vila Prudente',
       'Cambuci', 'Campo Belo', 'Campo Grande', 'Campo Limpo',
       'Capão Redondo', 'Cidade Ademar', 'Cidade Dutra', 'Cursino',
       'Grajaú', 'Ipiranga', 'Itaim Bibi', 'Jabaquara', 'Jardim Ângela',
       'Jardim Paulista', 'Jardim São Luis', 'Moema', 'Morumbi',
       'Pedreira', 'Sacomã', 'Santo Amaro', 'Saúde', 'Socorro',
       'Vila Andrade', 'Vila Mariana', 'Vila Sônia', 'Alto de Pinheiros',
       'Anhanguera', 'Brasilândia', 'Butantã', 'Cachoeirinha',
       'Freguesia do Ó', 'Jaguaré', 'Jaraguá', 'Lapa', 'Limão',
       'Perdizes', 'Perus', 'Pinheiros', 'Pirituba', 'Raposo Tavares',
       'Rio Pequeno', 'São Domingos', 'Vila Leopoldina'], dtype=object)

In [132]:
district_dummies = pd.get_dummies(final_df["District"])
district_dummies

,Alto de Pinheiros,Anhanguera,Aricanduva,Artur Alvim,Barra Funda,Bela Vista,Belém,Bom Retiro,Brasilândia,Brooklin,...,Vila Jacuí,Vila Leopoldina,Vila Madalena,Vila Maria,Vila Mariana,Vila Matilde,Vila Olimpia,Vila Prudente,Vila Sônia,Água Rasa
4901,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4902,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4903,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4904,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4905,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13635,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
13636,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
13637,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
13638,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
13639,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [133]:
final_df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,District
4901,732600,1000,74,1,2,1,2,1,0,1,0,Vila Madalena
4902,1990000,2400,164,4,5,2,3,1,1,1,0,Vila Madalena
4903,720000,700,70,2,2,1,1,1,0,1,1,Vila Madalena
4904,1680000,1580,155,3,5,3,2,1,0,1,0,Vila Madalena
4905,1200000,900,56,2,2,1,2,0,1,1,0,Vila Madalena
...,...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0,Jabaquara
13636,545000,630,74,3,2,1,2,0,0,1,0,Jabaquara
13637,515000,1100,114,3,3,1,1,0,0,1,0,Jabaquara
13638,345000,48,39,1,2,1,1,0,1,1,0,Jabaquara
13639,161987,0,44,2,1,0,1,0,0,0,0,Jardim Ângela

In [134]:
districtless_df = final_df.drop(columns=["District"])
districtless_df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New
4901,732600,1000,74,1,2,1,2,1,0,1,0
4902,1990000,2400,164,4,5,2,3,1,1,1,0
4903,720000,700,70,2,2,1,1,1,0,1,1
4904,1680000,1580,155,3,5,3,2,1,0,1,0
4905,1200000,900,56,2,2,1,2,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,0
13636,545000,630,74,3,2,1,2,0,0,1,0
13637,515000,1100,114,3,3,1,1,0,0,1,0
13638,345000,48,39,1,2,1,1,0,1,1,0
13639,161987,0,44,2,1,0,1,0,0,0,0

In [135]:
original_df = final_df

In [136]:
complete_df = pd.concat([districtless_df, district_dummies], axis=1)
complete_df

,Price,Condo,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,...,Vila Jacuí,Vila Leopoldina,Vila Madalena,Vila Maria,Vila Mariana,Vila Matilde,Vila Olimpia,Vila Prudente,Vila Sônia,Água Rasa
4901,732600,1000,74,1,2,1,2,1,0,1,...,0,0,1,0,0,0,0,0,0,0
4902,1990000,2400,164,4,5,2,3,1,1,1,...,0,0,1,0,0,0,0,0,0,0
4903,720000,700,70,2,2,1,1,1,0,1,...,0,0,1,0,0,0,0,0,0,0
4904,1680000,1580,155,3,5,3,2,1,0,1,...,0,0,1,0,0,0,0,0,0,0
4905,1200000,900,56,2,2,1,2,0,1,1,...,0,0,1,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13635,265000,420,51,2,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
13636,545000,630,74,3,2,1,2,0,0,1,...,0,0,0,0,0,0,0,0,0,0
13637,515000,1100,114,3,3,1,1,0,0,1,...,0,0,0,0,0,0,0,0,0,0
13638,345000,48,39,1,2,1,1,0,1,1,...,0,0,0,0,0,0,0,0,0,0
13639,161987,0,44,2,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [227]:
# x = districtless_df.drop(columns=["Price"])
# y = districtless_df["Price"]

x = complete_df.drop(columns=["Price", "Condo"])
y = complete_df["Price"]

x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=22)

In [228]:
x

,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,Alto de Pinheiros,...,Vila Jacuí,Vila Leopoldina,Vila Madalena,Vila Maria,Vila Mariana,Vila Matilde,Vila Olimpia,Vila Prudente,Vila Sônia,Água Rasa
4901,74,1,2,1,2,1,0,1,0,0,...,0,0,1,0,0,0,0,0,0,0
4902,164,4,5,2,3,1,1,1,0,0,...,0,0,1,0,0,0,0,0,0,0
4903,70,2,2,1,1,1,0,1,1,0,...,0,0,1,0,0,0,0,0,0,0
4904,155,3,5,3,2,1,0,1,0,0,...,0,0,1,0,0,0,0,0,0,0
4905,56,2,2,1,2,0,1,1,0,0,...,0,0,1,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13635,51,2,1,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
13636,74,3,2,1,2,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
13637,114,3,3,1,1,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
13638,39,1,2,1,1,0,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
13639,44,2,1,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [229]:
y

4901      732600
4902     1990000
4903      720000
4904     1680000
4905     1200000
          ...
13635     265000
13636     545000
13637     515000
13638     345000
13639     161987
Name: Price, Length: 6412, dtype: int64

In [230]:
print(len(x_train))
print(len(x_test))

5129
1283

In [245]:
minmax = MinMaxScaler()

x_train_scaled = minmax.fit_transform(x_train)
x_test_scaled = minmax.transform(x_test)

x_train_scaled

array([[0.26949153, 0.4       , 0.5       , ..., 0.        , 0.        ,
        0.        ],
       [0.        , 0.        , 0.        , ..., 1.        , 0.        ,
        0.        ],
       [0.02711864, 0.2       , 0.        , ..., 0.        , 0.        ,
        0.        ],
       ...,
       [0.61525424, 0.4       , 0.5       , ..., 0.        , 0.        ,
        0.        ],
       [0.06779661, 0.4       , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.06779661, 0.2       , 0.16666667, ..., 0.        , 0.        ,
        0.        ]])

In [246]:
scaler = StandardScaler()

x_train_scaled = scaler.fit_transform(x_train)
x_test_scaled = scaler.transform(x_test)

x_train_scaled

array([[ 2.2084926 ,  0.94960558,  2.16373513, ..., -0.12015944,
        -0.07137956, -0.10506585],
       [-0.96176171, -1.85196303, -1.13983626, ...,  8.32227577,
        -0.07137956, -0.10506585],
       [-0.64274241, -0.45117872, -1.13983626, ..., -0.12015944,
        -0.07137956, -0.10506585],
       ...,
       [ 6.2759887 ,  0.94960558,  2.16373513, ..., -0.12015944,
        -0.07137956, -0.10506585],
       [-0.16421346,  0.94960558, -1.13983626, ..., -0.12015944,
        -0.07137956, -0.10506585],
       [-0.16421346, -0.45117872, -0.0386458 , ..., -0.12015944,
        -0.07137956, -0.10506585]])

In [233]:
x_train

,Size,Rooms,Toilets,Suites,Parking,Elevator,Furnished,Swimming Pool,New,Alto de Pinheiros,...,Vila Jacuí,Vila Leopoldina,Vila Madalena,Vila Maria,Vila Mariana,Vila Matilde,Vila Olimpia,Vila Prudente,Vila Sônia,Água Rasa
11629,189,3,4,3,2,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
13343,30,1,1,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
11953,46,2,1,0,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8943,156,3,2,1,2,0,1,0,0,1,...,0,0,0,0,0,0,0,0,0,0
6333,40,2,2,1,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12706,98,2,1,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
5544,90,3,2,1,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
12136,393,3,4,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
13504,70,3,1,0,1,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
8121,70,2,2,1,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [236]:
def adjusted_r2(y_test, y_pred, X_train):
    from sklearn.metrics import r2_score

    adj_r2 = (1 - ((1 - r2_score(y_test, y_pred)) * (len(y_test) - 1)) /
              (len(y_test) - X_train.shape[1] - 1))

    return adj_r2

In [258]:
def metrics_builder(y_test, y_pred):
    MSE = metrics.mean_squared_error(y_test, y_pred)
    MAE = metrics.mean_absolute_error(y_test, y_pred)
    R2 = metrics.r2_score(y_test, y_pred)

    print("Squared Error: ", MSE)
    print("Absolute Error: ", MAE)
    print("R2: ", R2)

In [238]:
def mine_knn(x_train, x_test, y_train, y_test, k=0):
    if k == 0:
        k = int((len(y_train) + len(y_test)) ** 0.5)

    knn = KNeighborsRegressor(n_neighbors=k)

    knn.fit(x_train, y_train)

    y_pred = knn.predict(x_test)

    print("k:", k)

    metrics_builder(y_test, y_pred)

In [239]:
mine_knn(x_train_scaled, x_test_scaled, y_train, y_test)

k: 80
Squared Error:  287759337897.4824
Absolute Error:  254869.33642829306

In [240]:
for i in range(0, 20, 1):
    mine_knn(x_train_scaled, x_test_scaled, y_train, y_test, k=i)
    print()

k: 80
Squared Error:  287759337897.4824
Absolute Error:  254869.33642829306

k: 1
Squared Error:  135238361585.81528
Absolute Error:  157347.07170693687

k: 2
Squared Error:  113217943626.3297
Absolute Error:  147166.59236165238

k: 3
Squared Error:  115244987644.72072
Absolute Error:  149208.22395427385

k: 4
Squared Error:  108964785671.57954
Absolute Error:  146313.76091192517

k: 5
Squared Error:  109333968299.74008
Absolute Error:  146377.86578332036

k: 6
Squared Error:  117254041323.65286
Absolute Error:  150095.6002857885

k: 7
Squared Error:  123757878228.88065
Absolute Error:  154207.2406190847

k: 8
Squared Error:  125882988117.46709
Absolute Error:  156432.09255650817

k: 9
Squared Error:  128338762097.82838
Absolute Error:  157789.13146271757

k: 10
Squared Error:  134325915714.4087
Absolute Error:  160632.99158222915

k: 11
Squared Error:  137160631633.6533
Absolute Error:  162492.33118401474

k: 12
Squared Error:  143202159045.58984
Absolute Error:  166138.7713691868

k: 13
Squared Error:  147840369243.9255
Absolute Error:  168985.14359374062

k: 14
Squared Error:  154375753671.58267
Absolute Error:  171430.06324462753

k: 15
Squared Error:  162068160736.34998
Absolute Error:  173714.95229929851

k: 16
Squared Error:  171547887039.57187
Absolute Error:  177055.26456547156

k: 17
Squared Error:  172724748930.91898
Absolute Error:  178739.48516803447

k: 18
Squared Error:  175474231661.1959
Absolute Error:  180882.8788429895

k: 19
Squared Error:  179931296625.19287
Absolute Error:  183446.3650162038

In [241]:
def build_forest(x_train, x_test, y_train, y_test, trees, depth, impurity):
    floresta = RandomForestRegressor(n_estimators=trees, random_state=22)
    floresta.fit(x_train, y_train)

    y_pred = floresta.predict(x_test)

    print(f"Trees: {trees}, Depth: {depth}, Impurity: {impurity}")

    metrics_builder(y_test, y_pred)

In [242]:
for i in range(1, 21, 2):
    build_forest(x_train_scaled, x_test_scaled, y_train, y_test, trees=i, depth=5, impurity=0.0001)
    print()

Trees: 1, Depth: 5, Impurity: 0.0001
Squared Error:  137935616345.28336
Absolute Error:  155365.7909716669

Trees: 3, Depth: 5, Impurity: 0.0001
Squared Error:  93203894549.04631
Absolute Error:  130085.70590394818

Trees: 5, Depth: 5, Impurity: 0.0001
Squared Error:  77489580457.68631
Absolute Error:  122467.6937249429

Trees: 7, Depth: 5, Impurity: 0.0001
Squared Error:  71720978049.38002
Absolute Error:  118694.44845083207

Trees: 9, Depth: 5, Impurity: 0.0001
Squared Error:  69113530454.4719
Absolute Error:  116802.61189783811

Trees: 11, Depth: 5, Impurity: 0.0001
Squared Error:  69038599237.52954
Absolute Error:  116116.76905192845

Trees: 13, Depth: 5, Impurity: 0.0001
Squared Error:  69714089558.53406
Absolute Error:  116020.4611589799

Trees: 15, Depth: 5, Impurity: 0.0001
Squared Error:  67961688277.55222
Absolute Error:  114628.25569502097

Trees: 17, Depth: 5, Impurity: 0.0001
Squared Error:  67877129527.92927
Absolute Error:  115266.71015047618

Trees: 19, Depth: 5, Impurity: 0.0001
Squared Error:  66841133578.25117
Absolute Error:  114979.88191094095

In [259]:
def build_mlp(x_train, x_test, y_train, y_test, layers, iterations=100):
    mlp = MLPRegressor(hidden_layer_sizes=layers, max_iter=iterations, solver="lbfgs", random_state=1)
    mlp.fit(x_train, y_train)

    y_pred = mlp.predict(x_test)
    print(y_test)
    print()
    print(y_pred)
    print()

    print(f"Hidden layers: {layers}, Iterations: {iterations}")

    metrics_builder(y_test, y_pred)

In [260]:
build_mlp(x_train, x_test, y_train, y_test, (48, 24, 12, 6), 1000)

7868      335600
7225      334000
11679    4600000
7514      250000
6835      367000
          ...
11912     600000
5865      250000
11706    1060000
12904     268900
11784     430000
Name: Price, Length: 1283, dtype: int64

[ 387338.93654681  328129.44805519 3139351.98295853 ...  943832.8561268
  337207.75395487  530666.53494007]

Hidden layers: (48, 24, 12, 6), Iterations: 1000
Squared Error:  137459150345.24652
Absolute Error:  183695.95518722307
R2:  0.7804445354816147

In [261]:
build_mlp(x_train_scaled, x_test_scaled, y_train, y_test, (48, 24, 12, 6), 1000)

7868      335600
7225      334000
11679    4600000
7514      250000
6835      367000
          ...
11912     600000
5865      250000
11706    1060000
12904     268900
11784     430000
Name: Price, Length: 1283, dtype: int64

[ 358541.52676145  277029.25509095 2548437.77556862 ... 1358368.25359385
  273209.83723461  505596.8789694 ]

Hidden layers: (48, 24, 12, 6), Iterations: 1000
Squared Error:  586124526463.6866
Absolute Error:  202940.89014443403
R2:  0.06381756070702027

/usr/local/lib/python3.9/site-packages/sklearn/neural_network/_multilayer_perceptron.py:549: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
  self.n_iter_ = _check_optimize_result("lbfgs", opt_res, self.max_iter)